{
    "html_attributions": [],
    "result": {
        "name": "The Master Cleaners London",
        "reviews": [
            {
                "author_name": "Eli H",
                "author_url": "https://www.google.com/maps/contrib/115026382607726754894/reviews",
                "language": "en",
                "original_language": "en",
                "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJveEw8eczB5_Yr3ktbIJhYL20sKUvF6Z9k43XwFgVf04M=s128-c0x00000000-cc-rp-mo-ba4",
                "rating": 1,
                "relative_time_description": "5 months ago",
                "text": "I used to like this place a lot but cannot now endorse. They have recently changed the person at reception which has resulted in a very low quality of service. I have been told the following: no account under my name, my items have already been picked up, made to wait 5+ minutes in an empty store, no itemised bills after specifically requesting, among others.\n\nIf you are the owner and you see this post, I would be happy to discuss this further. I actually like the quality of your dry cleaning, but will not accept this service.",
                "time": 1685803546,
                "translated": false
            },
            {
                "author_name": "M (TOHMary)",
                "author_url": "https://www.google.com/maps/contrib/114912425240550346375/reviews",
                "language": "en",
                "original_language": "en",
                "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVe_JtZ2sjVfUCPHuEbH8IveHE6gi9v9q_nqwXkZCWMUQ=s128-c0x00000000-cc-rp-mo-ba5",
                "rating": 5,
                "relative_time_description": "a year ago",
                "text": "I came with no hope of having a stain removed out of I white cocktail dress- I was aware of the risk. They made it clear it was possible it may not work but would try their best. I picked it up a week later. Very small remnants/marks left not noticeable - lucky me. I would still say it is a success as it was an expensive dress.\n\nCocktail dress cleaning just under £50.",
                "time": 1667168659,
                "translated": false
            },
            {
                "author_name": "Peter Bavington",
                "author_url": "https://www.google.com/maps/contrib/116548076597129718520/reviews",
                "language": "en",
                "original_language": "en",
                "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLpIxHKy9XBnw0OlmDSpNtvGRnsJig51LCVqDwbcW82=s128-c0x00000000-cc-rp-mo",
                "rating": 5,
                "relative_time_description": "2 years ago",
                "text": "I cannot praise them enough. They undertook the cleaning, re-lining and repair of a large pair of beautiful old William Morris curtains, a job which another firm had declined, and everything was done beautifully and on time, with pleasant and friendly service to boot. They even supplied and fitted all the curtain hooks, saving me time in re-hanging them.",
                "time": 1606227486,
                "translated": false
            },
            {
                "author_name": "Nini Khatiblou",
                "author_url": "https://www.google.com/maps/contrib/111577965538270430353/reviews",
                "language": "en",
                "original_language": "en",
                "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIJRB__wfYWKBh1Vx7QU-7a9zjyxtRhJe1pZeFPJ4dJ=s128-c0x00000000-cc-rp-mo",
                "rating": 5,
                "relative_time_description": "2 years ago",
                "text": "I have been using Master Dry Cleaners for several months now - we are a young family with newborn babies and really needed help with our laundry (anyone with kids knows it's never ending!!). We had used a different laundry company before discovering Master Dry Cleaners and they were awful - they lost our clothes, they were unreliable with timings and the clothes never felt clean. I can honestly say hand on heart, that using Master Dry Cleaners has been the biggest game changer - our clothes are collected once a week and delivered a couple of days later. The standard is consistent and exceptional. It's an easy, seamless experience and one which I now can't imagine living without! I'm so happy I found them, thank you MDC :)",
                "time": 1616875982,
                "translated": false
            },
            {
                "author_name": "emma ve",
                "author_url": "https://www.google.com/maps/contrib/112571075907220429554/reviews",
                "language": "en",
                "original_language": "en",
                "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKgQKPN41U--OgnkNxYsi4_Qk2qqOC61q1moa5q03sz=s128-c0x00000000-cc-rp-mo",
                "rating": 5,
                "relative_time_description": "5 years ago",
                "text": "Barbara arranged for our very badly water-damaged (water stains from damp) curtains to be cleaned. I was amazed with the job when they came back - they were absolutely good as new! The curtains were wool fabric so not an easy job, they don't take to water well (it can stain and shrink them) but the company did manage to get all of the stains out perfectly without causing any damage. I was really pleased with the work done - absolutely worth the ££ and a very professional service. Thank you!",
                "time": 1514299576,
                "translated": false
            }
        ]
    },
    "status": "OK"
}